{
  "_package_info": {
    "display_name": "SciFi Cyberpunk Backgrounds",
    "description": "Character backgrounds for dystopian cyberpunk futures featuring corporate wage slaves, street hackers, augmented mercenaries, and underground rebels",
    "category": "Science Fiction",
    "version": "1.0",
    "author": "Storymaster"
  },
  "user": [],
  "setting": [],
  "storyline": [],
  "storyline_to_setting": [],
  "alignment": [],
  "background": [
    {
      "name": "Corporate Executive",
      "description": "High-ranking manager in a megacorporation wielding significant power and resources. Lives in luxury towers while orchestrating global business operations and crushing competition.",
      "setting_id": 1
    },
    {
      "name": "Wage Slave",
      "description": "Middle-management corporate employee trapped in endless bureaucracy and debt. Works grueling hours in sterile office complexes while dreaming of escape from the corporate machine.",
      "setting_id": 1
    },
    {
      "name": "Street Samurai",
      "description": "Cybernetically enhanced warrior-for-hire operating in the urban shadows. Combines traditional martial codes with cutting-edge augmentations and high-tech weapons.",
      "setting_id": 1
    },
    {
      "name": "Netrunner",
      "description": "Elite hacker who jacks into cyberspace to steal data and infiltrate corporate systems. Lives on the edge between virtual and physical reality with neural interface implants.",
      "setting_id": 1
    },
    {
      "name": "Corpo Spy",
      "description": "Corporate intelligence operative specializing in industrial espionage and sabotage. Maintains multiple identities while gathering secrets for megacorp masters.",
      "setting_id": 1
    },
    {
      "name": "Street Gang Member",
      "description": "Territorial fighter from the urban underbelly controlling neighborhoods through violence and intimidation. Survives by dealing drugs, weapons, and illegal cyberware.",
      "setting_id": 1
    },
    {
      "name": "Cyberdoc",
      "description": "Underground physician specializing in cybernetic implant installation and black market surgery. Operates illegal clinics for those who can't afford corporate medical care.",
      "setting_id": 1
    },
    {
      "name": "Techno-Shaman",
      "description": "Mystic who blends ancient spiritual practices with digital consciousness exploration. Believes technology and spirituality are interconnected paths to transcendence.",
      "setting_id": 1
    },
    {
      "name": "Corpo Security",
      "description": "Armed guard protecting corporate assets and executives from threats. Heavily augmented with combat implants and loyalty conditioning protocols.",
      "setting_id": 1
    },
    {
      "name": "Data Courier",
      "description": "Professional smuggler who transports sensitive information using encrypted neural storage. Maintains strict neutrality while carrying corporate and criminal data.",
      "setting_id": 1
    },
    {
      "name": "Rockerboy/Rockergirl",
      "description": "Rebellious musician using art to spread anti-corporate messages and inspire social change. Performs in underground venues while dodging corporate censorship.",
      "setting_id": 1
    },
    {
      "name": "Fixer",
      "description": "Underground broker who connects clients with specialists for illegal jobs. Maintains extensive networks of contacts in both criminal and corporate worlds.",
      "setting_id": 1
    },
    {
      "name": "Media Personality",
      "description": "Investigative journalist or entertainer with access to information networks. Risks everything to expose corporate corruption and government conspiracies.",
      "setting_id": 1
    },
    {
      "name": "Nomad Wanderer",
      "description": "Member of mobile tribe living outside city limits in the wasteland. Maintains independence from corporate control while scavenging and trading.",
      "setting_id": 1
    },
    {
      "name": "AI Researcher",
      "description": "Scientist studying artificial intelligence and digital consciousness. Works on the bleeding edge of technology while questioning the nature of sentience.",
      "setting_id": 1
    },
    {
      "name": "Biomod Dealer",
      "description": "Black market merchant specializing in biological and cybernetic enhancements. Provides illegal augmentations to those seeking to transcend human limitations.",
      "setting_id": 1
    },
    {
      "name": "Corporate Assassin",
      "description": "Professional killer employed by megacorporations to eliminate threats and competitors. Uses advanced stealth technology and exotic weapons.",
      "setting_id": 1
    },
    {
      "name": "Slum Dweller",
      "description": "Survivor from the overcrowded urban sprawl living in poverty and squalor. Struggles daily for basic necessities while avoiding corporate exploitation.",
      "setting_id": 1
    },
    {
      "name": "Cyberpunk Hacker",
      "description": "Anarchist programmer fighting corporate control through digital rebellion. Creates viruses and backdoors to disrupt the system from within.",
      "setting_id": 1
    },
    {
      "name": "Military Veteran",
      "description": "Former soldier from corporate wars now struggling to adapt to civilian life. Carries physical and psychological scars from battles fought for profit.",
      "setting_id": 1
    },
    {
      "name": "Underground Racer",
      "description": "High-speed driver competing in illegal street races through dangerous urban environments. Modifies vehicles with cutting-edge technology and contraband parts.",
      "setting_id": 1
    },
    {
      "name": "Virtual Reality Addict",
      "description": "Individual completely absorbed in digital worlds and online experiences. Struggles with reality addiction while living primarily in virtual spaces.",
      "setting_id": 1
    },
    {
      "name": "Corporate Scientist",
      "description": "Researcher working on experimental technology for megacorporation advancement. Develops new weapons, drugs, and augmentations regardless of ethical concerns.",
      "setting_id": 1
    },
    {
      "name": "Street Preacher",
      "description": "Religious zealot spreading spiritual messages in urban decay. Offers hope and salvation to the downtrodden while opposing corporate materialism.",
      "setting_id": 1
    },
    {
      "name": "Augmented Athlete",
      "description": "Professional sports competitor enhanced with cybernetic implants for superhuman performance. Competes in extreme sports leagues for corporate entertainment.",
      "setting_id": 1
    },
    {
      "name": "Black Market Trader",
      "description": "Merchant dealing in illegal goods and contraband technology. Operates from hidden markets while avoiding corporate law enforcement.",
      "setting_id": 1
    },
    {
      "name": "Memory Thief",
      "description": "Specialist who extracts and manipulates human memories using advanced neurotechnology. Works for corporations, criminals, and private clients.",
      "setting_id": 1
    },
    {
      "name": "Corporate Whistleblower",
      "description": "Former insider who exposed megacorporation crimes and now lives in hiding. Constantly evades assassination attempts while fighting for justice.",
      "setting_id": 1
    },
    {
      "name": "Cybernetic Monk",
      "description": "Ascetic who embraces technology as a path to spiritual enlightenment. Seeks perfect fusion of flesh and machine while maintaining philosophical detachment.",
      "setting_id": 1
    },
    {
      "name": "Drone Operator",
      "description": "Remote pilot controlling robotic units for surveillance, combat, or labor. Operates multiple mechanical bodies while remaining physically safe.",
      "setting_id": 1
    },
    {
      "name": "Scream Sheet Editor",
      "description": "Sensationalist news publisher spreading rumors, scandals, and conspiracy theories. Operates underground media networks beyond corporate censorship.",
      "setting_id": 1
    },
    {
      "name": "Corpo Lawyer",
      "description": "Legal advocate specializing in corporate law and contract negotiation. Helps megacorporations circumvent regulations while crushing opposition.",
      "setting_id": 1
    },
    {
      "name": "Synthetic Human",
      "description": "Artificially created being struggling with questions of identity and purpose. Possesses human-like consciousness but faces prejudice and exploitation.",
      "setting_id": 1
    },
    {
      "name": "Underground Doctor",
      "description": "Medical professional providing healthcare to those rejected by corporate medical systems. Operates illegal clinics in the slums and undercity.",
      "setting_id": 1
    },
    {
      "name": "Data Miner",
      "description": "Information specialist who extracts valuable data from digital sources and human minds. Sells intelligence to the highest bidder regardless of consequences.",
      "setting_id": 1
    },
    {
      "name": "Corporate Heir",
      "description": "Privileged offspring of megacorp dynasty groomed for leadership but potentially rebellious. Enjoys vast resources while questioning family legacy.",
      "setting_id": 1
    },
    {
      "name": "Street Shaman",
      "description": "Urban mystic who combines ancient wisdom with modern technology. Provides spiritual guidance to street communities while resisting corporate oppression.",
      "setting_id": 1
    },
    {
      "name": "Bounty Hunter",
      "description": "Licensed tracker who captures criminals and corporate fugitives for reward money. Uses advanced surveillance technology and lethal force.",
      "setting_id": 1
    },
    {
      "name": "Corpo Janitor",
      "description": "Maintenance worker with access to corporate secrets through cleaning duties. Often overlooked but potentially valuable as an inside source.",
      "setting_id": 1
    },
    {
      "name": "Resistance Fighter",
      "description": "Dedicated revolutionary working to overthrow corporate control and government oppression. Uses guerrilla tactics and underground networks.",
      "setting_id": 1
    }
  ],
  "class": [],
  "race": [],
  "sub_race": [],
  "stat": [],
  "skills": [],
  "actor": [],
  "actor_a_on_b_relations": [],
  "actor_to_skills": [],
  "actor_to_race": [],
  "actor_to_class": [],
  "actor_to_stat": [],
  "faction": [],
  "faction_a_on_b_relations": [],
  "faction_members": [],
  "location_": [],
  "location_to_faction": [],
  "location_dungeon": [],
  "location_city": [],
  "location_city_districts": [],
  "residents": [],
  "location_flora_fauna": [],
  "location_a_on_b_relations": [],
  "location_geographic_relations": [],
  "location_political_relations": [],
  "location_economic_relations": [],
  "location_hierarchy": [],
  "history": [],
  "history_actor": [],
  "history_location": [],
  "history_faction": [],
  "object_": [],
  "history_object": [],
  "object_to_owner": [],
  "world_data": [],
  "history_world_data": [],
  "arc_type": [],
  "litography_node": [],
  "node_connection": [],
  "litography_notes": [],
  "litography_plot": [],
  "litography_plot_section": [],
  "litography_node_to_plot_section": [],
  "litography_arc": [],
  "arc_point": [],
  "arc_to_node": [],
  "arc_to_actor": [],
  "litography_note_to_actor": [],
  "litography_note_to_background": [],
  "litography_note_to_faction": [],
  "litography_note_to_location": [],
  "litography_note_to_history": [],
  "litography_note_to_object": [],
  "litography_note_to_world_data": [],
  "litography_note_to_class": [],
  "litography_note_to_race": [],
  "litography_note_to_sub_race": [],
  "litography_note_to_skills": []
}